{
  "backend/main.mo": "Defines product, user, and order types with access-controlled CRUD logic for profiles, products, and orders using role-based authorization.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing styling, components, hooks, and UI behavior.",
  "frontend/index.css": "Tailwind base layer with CSS variables defining light/dark theme tokens and global background/foreground styling.",
  "frontend/index.html": "HTML entrypoint loading Tailwind, fonts, import maps, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing auth, role-based views, layout, modals, and rendering hero, product grid, admin or vendor sections.",
  "frontend/src/components/admin/AdminPanel.tsx": "Admin dashboard with tabbed UI for managing products and adding new ones.",
  "frontend/src/components/admin/AdminProductTable.tsx": "Displays all products with loading states, availability toggles, delete actions, and confirmation workflow.",
  "frontend/src/components/admin/ConfirmDialog.tsx": "Reusable confirmation dialog component with loading state using AlertDialog primitives.",
  "frontend/src/components/admin/ProductForm.tsx": "Renders a form to create a new product with validation and submits via useCreateProduct. Resets fields and triggers success handling after creation.",
  "frontend/src/components/auth/LoginButton.tsx": "Displays a login/logout button that handles Internet Identity auth and shows appropriate icons and states. Clears queries on logout and retries if user is already authenticated.",
  "frontend/src/components/auth/LogoLoginChooser.tsx": "A popover allowing users to choose customer or vendor mode and trigger login. Positions itself relative to a logo anchor and closes on outside click or escape.",
  "frontend/src/components/auth/ModeSelector.tsx": "Provides a tab UI to switch between customer and vendor auth modes. Updates global mode state via useAuthMode.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal that prompts for a user's name and saves their profile via useSaveCallerUserProfile. Shows success or error notifications on submit.",
  "frontend/src/components/brand/Logo.tsx": "Displays the MyLocal Kart logo with optional click behavior. Can render as a button or static element based on props.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with copyright text and a link to caffeine.ai. Includes a small animated heart and year display.",
  "frontend/src/components/layout/Header.tsx": "Displays the app header with logo, role badges, cart button, and login button. Handles opening login chooser and cart sheet based on user state.",
  "frontend/src/components/storefront/CartSheet.tsx": "Implements the cart sidebar with item management, availability checks, and checkout flow. Shows order confirmation after successful checkout and handles payment method selection.",
  "frontend/src/components/storefront/OrderConfirmationPanel.tsx": "Displays order confirmation details including metadata, item list, totals, and a continue button.",
  "frontend/src/components/storefront/ProductCard.tsx": "Renders a product card with image, price, stock status, and add‑to‑cart logic.",
  "frontend/src/components/storefront/ProductGrid.tsx": "Fetches and displays product lists with admin toggles for all vs available products and loading/error states.",
  "frontend/src/components/storefront/StorefrontHero.tsx": "Static hero section with marketing text and a hero image for the storefront.",
  "frontend/src/components/vendor/VendorPortal.tsx": "Vendor dashboard with tabs for managing products and adding new ones.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "Form for vendors to create products, handling validation and submission to backend.",
  "frontend/src/components/vendor/VendorProductTable.tsx": "Displays vendor products with controls for availability toggling and deletion, handling loading/error states.",
  "frontend/src/hooks/auth/useAuthMode.ts": "Stores and retrieves the app auth mode (customer/vendor) from localStorage.",
  "frontend/src/hooks/auth/useCallerProfile.ts": "Fetches the current user's profile via the actor, managing loading and availability state.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Retrieves the caller's role and exposes convenience booleans for role checks and auth state.",
  "frontend/src/hooks/auth/useSaveProfile.ts": "Defines a mutation to save the caller’s user profile and invalidates related queries on success.",
  "frontend/src/hooks/cart/useCart.tsx": "Implements a React context for managing cart items with add, remove, update, subtotal, and total helpers.",
  "frontend/src/hooks/orders/useCheckout.ts": "Provides a checkout mutation that validates the cart and triggers an actor checkout call while refreshing order data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor instance and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains product-related queries and mutations including fetch, create, delete, and toggle availability.",
  "frontend/src/hooks/vendor/useVendorProducts.ts": "Fetches products associated with the logged-in vendor’s principal using the actor.",
  "frontend/src/index.css": "Defines global Tailwind-based styles and theme variables including dark mode and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/currency.ts": "Formats numeric or bigint prices into INR currency strings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom theme extensions (fonts, oklch colors, radii, shadows), and animations using typography, container-queries, and animate plugins.",
  "project_state.json": "Project state definition containing app summary, architecture notes, known issues, image requirements, and feature metadata for the MyLocal Kart build."
}