{
  "backend/main.mo": "Motoko canister implementing role-based access control, user profiles, and product catalog with create/delete and vendor tracking.",
  "feature_evidence.json": "Feature evidence report documenting a branding update task and its related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing styling, hooks, components, and UI features.",
  "frontend/index.css": "Defines Tailwind base layers and extensive OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry point setting the app title and loading the main React script.",
  "frontend/src/App.tsx": "Main React app setting up auth state, profile modal, admin/vendor portals, hero section, and product grid within a theme provider.",
  "frontend/src/components/admin/AdminPanel.tsx": "Admin interface providing tabs for managing products and adding new ones.",
  "frontend/src/components/admin/AdminProductTable.tsx": "Admin product table with loading states, availability toggles, delete actions, and confirmation dialog.",
  "frontend/src/components/admin/ConfirmDialog.tsx": "Reusable alert dialog for confirming destructive actions with optional loading state.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component that collects product details and submits them via createProduct mutation. Handles validation, success/error toasts, and form reset.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity that manages auth flow, error handling, and dynamic button text/icons.",
  "frontend/src/components/auth/ModeSelector.tsx": "Provides customer/vendor mode switching using tab controls tied to auth mode state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and save their profile using a mutation.",
  "frontend/src/components/brand/Logo.tsx": "Renders the MyLocal Kart logo image and brand text.",
  "frontend/src/components/layout/Footer.tsx": "Displays the app footer with copyright text and a link to caffeine.ai including tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, role badges, mode selector, and login button, adapting to authentication state.",
  "frontend/src/components/storefront/ProductCard.tsx": "Displays a product with image, price, unit label, description, and stock status indicators.",
  "frontend/src/components/storefront/ProductGrid.tsx": "Fetches and displays available or all products (for admins), with loading, error, and empty states.",
  "frontend/src/components/storefront/StorefrontHero.tsx": "Hero section with promotional text, animated highlights, and a hero image for the storefront.",
  "frontend/src/components/vendor/VendorPortal.tsx": "Vendor dashboard with tabs for managing existing products and adding new ones.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "A form component for vendors to create products, handling validation, price conversion, and submission via a createProduct mutation.",
  "frontend/src/components/vendor/VendorProductTable.tsx": "Displays a vendor’s products with loading and error states, allowing availability toggling and deletion with confirmation.",
  "frontend/src/hooks/auth/useAuthMode.ts": "Manages and persists the user's auth mode (customer or vendor) in localStorage.",
  "frontend/src/hooks/auth/useCallerProfile.ts": "Fetches the current user's profile using the actor, with loading state tied to actor readiness.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Retrieves the caller’s role and exposes convenience booleans for role checks and authentication state.",
  "frontend/src/hooks/auth/useSaveProfile.ts": "Mutation hook to save the caller’s profile and invalidate related queries on success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, identity loading, and status tracking via React context.",
  "frontend/src/hooks/useQueries.ts": "Contains product-related queries and mutations, including fetching, creating, deleting, and toggling availability.",
  "frontend/src/hooks/vendor/useVendorProducts.ts": "Fetches products for the authenticated vendor using their principal.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables plus custom utility classes like glass effects and neon glow.",
  "frontend/src/main.tsx": "App entry point mounting React with query client and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), storing them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, fonts, and plugin setup for the app’s futuristic UI.",
  "project_state.json": "Describes the project’s current state, architecture notes, known issues, and a list of implemented features for the MyLocal Kart app."
}