{
  "kind": "build_request",
  "title": "Update app logo image and show Customer/Vendor login options when clicking the logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Replace the current header logo image with a new static logo asset, and keep the displayed brand text as exactly “MyLocal Kart”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the logo image of the app"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image file exists under frontend/public/assets/generated and is used by the header logo component.",
        "The logo image rendered in the header no longer uses /assets/generated/mylocal-kart-upload-logo.dim_256x256.png.",
        "The visible brand text next to the logo reads exactly “MyLocal Kart”.",
        "The logo <img> has an English alt text that refers to “MyLocal Kart” (e.g., “MyLocal Kart Logo”)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Make the header logo symbol clickable so that when the user is not authenticated, clicking the logo opens a small login chooser that lets the user select either Customer or Vendor mode and then initiate login for the selected mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let the login option be for both vendor and customer. when they click at the symbol."
        ]
      },
      "acceptanceCriteria": [
        "When logged out, clicking the logo (image/symbol area) opens an on-screen UI (popover/dropdown/dialog) that shows both options: “Customer” and “Vendor”.",
        "Selecting “Customer” or “Vendor” updates the auth mode used by the existing login flow.",
        "The login action is available from that UI and uses the same Internet Identity login flow as the existing LoginButton.",
        "The login chooser UI uses English labels (“Customer”, “Vendor”, and a login call-to-action in English).",
        "The existing standalone ModeSelector in the header is removed or hidden when logged out, so the primary way to choose mode is via clicking the logo symbol.",
        "When logged in, clicking the logo does not block normal navigation/behavior (e.g., it can behave as a home link or do nothing), and does not force a mode change."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components); only compose them.",
    "Do not modify immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Implementing new authentication providers beyond Internet Identity.",
    "Changing backend authorization or role logic.",
    "Redesigning the storefront hero or other branding assets beyond the header logo image."
  ],
  "imageRequirements": {
    "required": [
      "Futuristic grocery-themed monogram/logo mark with neon-green accents on dark background (mylocal-kart-logo-v2.dim_256x256.png)"
    ],
    "edits": []
  }
}